; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_2 type_3)
 (:predicates (pred_1 ?v6 - type_2 ?v4 - type_1)
 	      (pred_2 ?v7 - object ?v4 - type_1)
	      (pred_3 ?v6 - type_2 ?v2 - type_3)
	      (pred_4 ?v6 - type_2 ?v7 - object ?v2 - type_3))

   (:action op_1
       :parameters  (?v6 - type_2 ?v1 ?v3 - type_1)
       :precondition (and  (pred_1 ?v6 ?v1))
       :effect (and  (pred_1 ?v6 ?v3)
		     (not (pred_1 ?v6 ?v1))))

   (:action op_2
       :parameters (?v6 - type_2 ?v8 - object ?v5 - type_1 ?v2 - type_3)
       :precondition  (and  (pred_2 ?v8 ?v5) (pred_1 ?v6 ?v5) (pred_3 ?v6 ?v2))
       :effect (and (pred_4 ?v6 ?v8 ?v2)
		    (not (pred_2 ?v8 ?v5)) 
		    (not (pred_3 ?v6 ?v2))))

   (:action op_3
       :parameters (?v6 - type_2 ?v8 - object ?v5 - type_1 ?v2 - type_3)
       :precondition  (and  (pred_4 ?v6 ?v8 ?v2) (pred_1 ?v6 ?v5))
       :effect (and (pred_2 ?v8 ?v5)
		    (pred_3 ?v6 ?v2)
		    (not (pred_4 ?v6 ?v8 ?v2)))))

; problem
(define (problem gripper-2-4-4)
(:domain gripper-strips)
(:objects obj_01 obj_07 - type_2
obj_09 obj_02 obj_12 obj_11 - type_3
obj_08 obj_04 obj_10 obj_05 - type_1
obj_06 obj_13 obj_14 obj_03 - object)
(:init
(pred_1 obj_01 obj_04)
(pred_3 obj_01 obj_09)
(pred_3 obj_01 obj_02)
(pred_1 obj_07 obj_04)
(pred_3 obj_07 obj_12)
(pred_3 obj_07 obj_11)
(pred_2 obj_06 obj_04)
(pred_2 obj_13 obj_05)
(pred_2 obj_14 obj_04)
(pred_2 obj_03 obj_10)
)
(:goal
(and
(pred_2 obj_06 obj_10)
(pred_2 obj_13 obj_10)
(pred_2 obj_14 obj_04)
(pred_2 obj_03 obj_05)
)
)

(:constraints
  (always (not (pred_1 obj_01 obj_10)))
)
)

; plan
1. (op_2 obj_01 obj_06 obj_04 obj_02)
   deleted: (pred_2 obj_06 obj_04) (pred_3 obj_01 obj_02)
   added: (pred_4 obj_01 obj_06 obj_02)
   goals met: 1 of 4
2. (op_1 obj_07 obj_04 obj_10)
   deleted: (pred_1 obj_07 obj_04)
   added: (pred_1 obj_07 obj_10)
   goals met: 1 of 4
3. (op_1 obj_01 obj_04 obj_05)
   deleted: (pred_1 obj_01 obj_04)
   added: (pred_1 obj_01 obj_05)
   goals met: 1 of 4
4. (op_2 obj_07 obj_03 obj_10 obj_11)
   deleted: (pred_2 obj_03 obj_10) (pred_3 obj_07 obj_11)
   added: (pred_4 obj_07 obj_03 obj_11)
   goals met: 1 of 4
5. (op_1 obj_07 obj_10 obj_05)
   deleted: (pred_1 obj_07 obj_10)
   added: (pred_1 obj_07 obj_05)
   goals met: 1 of 4
6. (op_3 obj_01 obj_06 obj_05 obj_02)
   deleted: (pred_4 obj_01 obj_06 obj_02)
   added: (pred_2 obj_06 obj_05) (pred_3 obj_01 obj_02)
   goals met: 1 of 4
7. (op_3 obj_07 obj_03 obj_05 obj_11)
   deleted: (pred_4 obj_07 obj_03 obj_11)
   added: (pred_2 obj_03 obj_05) (pred_3 obj_07 obj_11)
   goals met: 2 of 4
8. (op_2 obj_07 obj_13 obj_05 obj_11)
   deleted: (pred_2 obj_13 obj_05) (pred_3 obj_07 obj_11)
   added: (pred_4 obj_07 obj_13 obj_11)
   goals met: 2 of 4
9. (op_1 obj_07 obj_05 obj_10)
   deleted: (pred_1 obj_07 obj_05)
   added: (pred_1 obj_07 obj_10)
   goals met: 2 of 4
10. (op_3 obj_07 obj_13 obj_10 obj_11)
   deleted: (pred_4 obj_07 obj_13 obj_11)
   added: (pred_2 obj_13 obj_10) (pred_3 obj_07 obj_11)
   goals met: 3 of 4
11. (op_1 obj_07 obj_10 obj_05)
   deleted: (pred_1 obj_07 obj_10)
   added: (pred_1 obj_07 obj_05)
   goals met: 3 of 4
12. (op_2 obj_07 obj_06 obj_05 obj_11)
   deleted: (pred_2 obj_06 obj_05) (pred_3 obj_07 obj_11)
   added: (pred_4 obj_07 obj_06 obj_11)
   goals met: 3 of 4
13. (op_1 obj_07 obj_05 obj_10)
   deleted: (pred_1 obj_07 obj_05)
   added: (pred_1 obj_07 obj_10)
   goals met: 3 of 4
14. (op_3 obj_07 obj_06 obj_10 obj_11)
   deleted: (pred_4 obj_07 obj_06 obj_11)
   added: (pred_2 obj_06 obj_10) (pred_3 obj_07 obj_11)
   goals met: 4 of 4
